# Задача 2

t = int(input("Введите время в секундах -"))
Ho = t//3600
Mi = (t - Ho*3600)//60
Se = t - Ho*3600 - Mi*60

print("Время - ", (Ho),":",(Mi),":",(Se))

# Задача 3

n = input("Введите произвольное число -")
print("Сумма чисел n+nn+nnn равна: ", (int(n) + int(n + n) + int(n + n + n)))
